[
  {
    "name": "Vehikl",
    "logo": "vehikl.svg",
    "flipLogo": true,
    "intro": "Vehikl tiene un profundo conocimiento de Vue y actuará como una extensión de su equipo. Nos enfocamos en escribir código limpio y mantenible. Nos apasiona la mejora continua, y practicamos Mob Programming y Pair Programming en el día a día.",
    "description": [
      "Vehikl es un equipo que valora el cuidado, el crecimiento y la entrega. Infundimos esos valores en todo lo que hacemos y en todas las personas con las que trabajamos. Nuestro objetivo es ser una extensión de sus esfuerzos de desarrollo, y construir aplicaciones web y móviles excepcionales.",
      "Nuestro equipo tiene una fuerte especialidad y un profundo conocimiento de los frameworks Vue, Laravel y React. Además de esto, nuestro equipo de 75 personas ha trabajado con cada pila tecnológica que puedas imaginar. Estamos orgullosos de ser desarrolladores orientados a las pruebas que se centran en escribir un código limpio y mantenible. Nuestro equipo está apasionado con la mejora continua, y practicamos Mob Programming y Pair Programming a diario.",
      "Hemos trabajado en proyectos de una amplia gama de empresas que van desde startups hasta organizaciones de nivel empresarial. Somos un solo equipo con nuestros clientes y compartimos sus éxitos.",
      "¿Y cómo es trabajar con nosotros?",
      "- Comunicación diaria con su equipo.",
      "- Colaborar con usted en la Planificación del Sprint semanal o quincenal.",
      "- Demos y Retrospectivas al final de cada Sprint.",
      "- Revisiones colaborativas de RP.",
      "- Sesiones diarias de Pairing y Mobbing.",
      "Siempre buscamos oportunidades para aprender cosas nuevas y mejorar nuestras habilidades utilizando el desarrollo lean Agile, la comunicación abierta y la colaboración. Combinamos la comunicación uno a uno y los valores iterativos de la metodología Agile para entregar código de alta calidad.",
      "Somos miembros activos de la comunidad JavaScript y PHP, y nos encanta colaborar con otros entusiastas."
    ],
    "proficiencies": ["Vue", "Laravel", "React", "Node.js", "Unity"],
    "region": ["Norte América"],
    "location": ["Ontario, Canada"],
    "website": {
      "text": "www.vehikl.com",
      "url": "https://www.vehikl.com?utm_source=vue_partners_page"
    },
    "contact": "go+vuepartner@vehikl.com",
    "hiring": "https://vehikl.com/jobs/developer/",
    "platinum": true
  },
  {
    "name": "Passionate People",
    "logo": "passionatepeople.png",
    "flipLogo": true,
    "intro": "Le proporcionamos capacidad técnica adicional para potenciar sus viajes de transformación digital con nuestros equipos de ingenieros y consultores de primera clase. Ingenieros Full Stack JavaScript Cloud listos para trabajar con usted y sus equipos.",
    "description": [
      "Fundada en octubre de 2017, Passionate People es la consultora de JavaScript líder en los Países Bajos.",
      "Nuestro objetivo es ayudar a nuestros clientes a acelerar sus iniciativas de transformación digital a escala, y nuestro estándar es el más alto del sector.",
      "Tenemos una amplia base de clientes que abarcan sectores como FinTech, E-commerce, Logística, Cadena de Suministro, Automatización Industrial, etc. Para lograr sus objetivos digitales y hacer que sus productos sean escalables y seguros para millones de usuarios, empresas como Albert Heijn Digital, GrandVision, Nationale Nederlanden, Talpa y AKQA han confiado en nosotros para realizar un trabajo de máxima calidad.",
      "Además de ser la principal consultora de JavaScript en los Países Bajos, Passionate People también se enorgullece de acoger las mayores conferencias tecnológicas y eventos de la comunidad en el mundo.",
      "Comenzando en febrero de 2018 con Frontend Love and Vue.js Amsterdam, ahora somos responsables de muchas otras conferencias en Europa bajo la marca Frontend Love: React Live, AngularNL, Vue.js Amsterdam y JS World Conference."
    ],
    "proficiencies": ["Vue", "Nuxt", "Node.js", "JAMStack"],
    "region": ["Europa"],
    "location": ["Amsterdam, Netherlands"],
    "website": {
      "text": "passionatepeople.io",
      "url": "https://passionatepeople.io/"
    },
    "contact": "info@passionatepeople.io",
    "platinum": true
  },
  {
    "name": "Monterail",
    "logo": "monterail.png",
    "intro": "Monterail es una empresa de desarrollo de software de servicio completo de Polonia. Desde 2010, hemos estado construyendo software innovador para start-ups, PYMES y empresas de diversas industrias a nivel mundial. Nuestros expertos en Vue, utilizando tecnologías y frameworks de probada eficacia, han realizado más de 30 proyectos basados en Vue.",
    "description": [
      "En una consultoría de servicios completos como Monterail, tienes todas las competencias bajo un mismo techo. Desde el concepto hasta el diseño y el lanzamiento del producto. Dependiendo de la fase del ciclo de vida del producto, guiamos a los clientes en la creación de aplicaciones desde cero o en su rápida ampliación.",
      "Un variado grupo de expertos, entre los que se encuentran diseñadores de productos, especialistas en control de calidad y analistas de negocio, se encargan de la consulta profesional de la pila tecnológica y de la validación de la idea de negocio. Trabajamos dentro de la metodología Agile, asegurando un flujo de comunicación fluido y apuntando a asociaciones a largo plazo. Hemos desarrollado todo tipo de aplicaciones Vue, desde visitas inmobiliarias virtuales hasta plataformas de donación.",
      "¿Por qué Monterail?",
      "- Incluida en el ranking 1000 del Financial Times dos veces consecutivas (2018 y 2019).",
      "- Reconocida por Deloitte como una de las empresas tecnológicas de más rápido crecimiento en Europa Central (2016 & 2017).",
      "- Calificada con 4,7/5 en Clutch.",
      "- Puntuación NPS - 71.",
      "- Expertos en desarrollo y diseño de software con sólida experiencia empresarial.",
      "- Un equipo con experiencia en trabajo remoto en un entorno multicultural.",
      "- Estimación detallada del presupuesto obtenido en semanas, no en meses."
    ],
    "proficiencies": [
      "Vue.js",
      "Ruby on Rails",
      "Node.js",
      "React Native",
      "Flutter"
    ],
    "region": ["Europa"],
    "website": {
      "text": "www.monterail.com",
      "url": "https://www.monterail.com/?utm_source=vuejs.org&utm_medium=referral&utm_campaign=partners"
    },
    "contact": "hello@monterail.com",
    "hiring": "https://www.monterail.com/careers?utm_source=vuejs.org&utm_medium=referral&utm_campaign=partner-hiring-link",
    "platinum": true
  },
  {
    "name": "Curotec",
    "logo": "curotec.png",
    "intro": "Nuestros clientes aprovechan nuestra profunda experiencia en Vue.js y Nuxt.js para desarrollar los mejores productos digitales y expandir rápidamente la velocidad de su equipo de desarrollo de productos.",
    "description": [
      "Curotec aborda el desarrollo de software y el soporte de TI de forma diferente: aborda los problemas empresariales que nuestros clientes nos dicen que necesitan que se resuelvan con tecnología y con los recursos adecuados en el momento adecuado. Eso comienza con la comprensión de sus retos y el acompañamiento en las soluciones y el talento para obtener el resultado que se busca.",
      "¿El resultado? Productos que responden a sus necesidades y están pensados para su crecimiento, al tiempo que garantizan que sus aplicaciones tengan una experiencia limpia y sencilla para el usuario final. Y con un código bien desarrollado y elegantemente escrito, nos resulta fácil dar soporte y mantenimiento a medida que sus necesidades evolucionan."
    ],
    "region": ["Norte América", "Latino América"],
    "proficiencies": ["Vue", "Nuxt", "Laravel", "Jamstack"],
    "website": {
      "text": "www.curotec.com",
      "url": "https://www.curotec.com/services/technologies/vuejs/"
    },
    "contact": "sales@curotec.com",
    "hiring": "https://www.curotec.com/careers?source=vuejs-partner",
    "platinum": true
  },
  {
    "name": "64 Robots",
    "logo": "64robots.svg",
    "intro": "Somos un equipo de expertos en Vue / Nuxt que crea aplicaciones modernas, bellamente diseñadas y de vanguardia. Ya sea construyendo algo nuevo, refactorizando un proyecto existente o pasando a Vue/Nuxt 3, le daremos un enfoque personal y cuidadoso al desarrollo.",
    "description": [
      "Nos especializamos en la construcción de APIs de Laravel, SPAs de Vue.js 2/3, aplicaciones SSR de Nuxt.js 2/3 y aplicaciones móviles de Flutter.",
      "Nos encanta trabajar con empresas de todos los tamaños. Hemos guiado a startups financiadas en su etapa inicial hacia un lanzamiento exitoso y hemos ayudado a grandes compañías internacionales a refactorizar y reconstruir productos existentes para escalar hacia el futuro. Sean cuales sean sus necesidades, le ayudaremos a tomar las decisiones tecnológicas correctas y a construir un producto optimizado que le pondrá en el camino del éxito.",
      "Nos distinguimos por nuestro nivel de compromiso con su producto. Piense en nosotros como una extensión de su equipo. Tanto si aumentamos el equipo existente como si entramos como CTO de facto para tomar las decisiones técnicas, estamos ahí para usted. Somos selectivos con los productos que aceptamos, ya que realmente queremos creer en nuestro trabajo y hacer todo lo posible para que tengan éxito. Su éxito es nuestro éxito."
    ],
    "region": ["Norte América", "Europa", "África"],
    "proficiencies": ["Vue", "Nuxt", "Laravel", "Flutter", "Node.js"],
    "website": {
      "text": "64robots.com",
      "url": "https://64robots.com/"
    },
    "contact": "rob@64robots.com",
    "platinum": true
  },
  {
    "name": "DevSquad",
    "logo": "devsquad.png",
    "intro": "Puede pensar en DevSquad como los Navy SEALs del desarrollo de software. Los miembros de nuestro equipo tienen habilidades únicas y diversas, y esta funcionalidad cruzada nos permite completar con éxito cualquier misión.",
    "description": [
      "Todos nuestros clientes tienen su propio equipo dedicado. Incluso si necesita 30 desarrolladores, todos los que trabajan en su proyecto se dividen en pequeños equipos agiles de 2 a 6 personas. Al igual que los Navy SEALs, un pequeño equipo probado en batalla puede moverse más rápido y con más precisión que los equipos más grandes.",
      "En lugar del código lleno de errores que puede haber recibido en el pasado, escribimos un software robusto y lo probamos a fondo. Pero en lugar de probarlo manualmente, escribimos código adicional para probar su código. Esto garantiza que los errores se detecten rápida y automáticamente antes de que sus empleados o clientes toquen el software. Y evita problemas mayores en el futuro cuando intente ampliar el uso o añadir nuevas funciones.",
      "DevSquad le da las evidencias probadas y toda la experiencia que necesita para construir su software mejor, más rápido y correcto desde el principio."
    ],
    "region": ["Norte América"],
    "proficiencies": ["Vue.js", "Laravel", "Node.js"],
    "website": {
      "text": "devsquad.com",
      "url": "https://devsquad.com/vuejs-developers/"
    },
    "contact": "phil@devsquad.com",
    "platinum": true
  },
  {
    "name": "Tighten",
    "logo": "tighten.svg",
    "flipLogo": true,
    "intro": "Tratar bien a las personas, resolver los problemas adecuados y crear un software espectacular: así es como funcionamos. Estamos muy centrados y tenemos una gran experiencia en la tecnología que impulsa los negocios modernos, incluyendo Vue.js. A través de nuestro método característico, nuestro equipo meticulosamente ensamblado ofrece un servicio inigualable, ayudándole a hacer más con su software, y a hacer lo correcto para su negocio.",
    "description": [
      "Un desarrollo con opinión empática y ejecutado por expertos. Eso es lo que ofrecemos.",
      "En Tighten, nos preocupamos por los detalles para dar a su aplicación el ajuste y el acabado que los usuarios de hoy en día esperan, mientras que le proporcionamos la claridad y la confianza para seguir adelante.",
      "Ya sea que busque simplemente mejorar una interfaz de usuario o construir una sofisticada aplicación basada en JavaScript, lo tenemos cubierto. Vue.js es un framework flexible y robusto, capaz de proporcionar una aplicación de una sola página compleja. Habitualmente lo combinamos con una API basada en Laravel.",
      "Si está formando un equipo de desarrollo, sabe que requiere tiempo y diligencia, y esto podría ser el factor decisivo para su negocio. Las empresas recurren a Tighten en puntos de inflexión clave para impulsar su tecnología mientras reúnen el equipo <b>correcto</b> para su negocio."
    ],
    "region": ["Norte América", "Europa", "Latino América"],
    "proficiencies": ["Vue", "Nuxt", "Laravel", "Inertia", "Tailwind"],
    "website": {
      "text": "tighten.com",
      "url": "https://tighten.com/vue"
    },
    "contact": "keith.damiani@tighten.co",
    "platinum": true
  },
  {
    "name": "Redberry",
    "logo": "redberry.png",
    "intro": "Somos una agencia de diseño de software, desarrollo y marketing de crecimiento de Tiflis, socio de Laravel y Vue, ganadora de más de 100 premios. En 8 años, hemos llevado más de 300 productos de cero a héroe usando Vue, Laravel, React y React Native para clientes que van desde startups e instituciones gubernamentales hasta agencias y empresas internacionales.",
    "description": [
      "Redberry nació en 2014 como un emprendimiento de cuatro amigos para llevar la transformación digital al negocio del ladrillo en Georgia. Hoy somos más de 150 y representamos la mayor agencia georgiana. Somos multifacéticos en todos los sentidos: tecnología, servicios, personas. Acompañamos a nuestros clientes a lo largo de todo el recorrido del producto: desde su diseño hasta su desarrollo y crecimiento. Contamos con un equipo galardonado internacionalmente de más de 100 diseñadores UX/UI legendarios, desarrolladores de software, ingenieros DevOps, gestores de proyectos, scrum masters, estrategas digitales, redactores publicitarios, creadores de contenido y growth hackers. Así que llámenos su socio digital de navaja suiza si quiere; nosotros lo hacemos.",
      "Aunque somos una agencia de primer nivel, una de las cosas más bonitas de nosotros es nuestra ubicación, tanto literal como metafóricamente. Tenemos nuestra sede en Georgia (el país, no el estado), donde la subcontratación de TI está casi exenta de impuestos. Gracias a ello, nuestras startups, agencias y empresas asociadas con sede en la UE y en Estados Unidos disfrutan de un mayor recorrido y de unos márgenes de proyecto más importantes. Por suerte, tenemos una capacidad sustancial y un fácil acceso al talento tecnológico local en rápido crecimiento, por lo que somos el socio fiable y escalable de nuestros clientes.",
      "Además de ser una casa de software oficial de Laravel y ahora Socio de Vue, somos una agencia de crecimiento creativo asociada a Google y Facebook, lo que nos convierte en un socio ideal de servicio completo para que más de 80 empresas de todos los tamaños hagan crecer su negocio progresivamente. También nos ha hecho ganar los títulos de Mejor Agencia del Año dos veces en 3 años, de 2019 a 2021. El negocio de nuestros clientes es nuestro negocio, por lo que nos mantenemos orientados a los resultados en todo momento, dentro y fuera del horario laboral, entre semana y los fines de semana, para asegurarnos de ofrecer las soluciones que impulsan los resultados de su negocio. Esa mentalidad ha dado forma a nuestra lista de clientes con líderes y finalistas del sector financiero, de seguros, inmobiliario, automovilístico, educativo, sanitario, etc.",
      "En cuanto a la metodología, dirigir nuestro estudio de startups ha imprimido la agilidad en nuestro ADN. Hemos construido una docena de MVP y hemos seguido desarrollándolos a lo largo del tiempo en función de los requisitos empresariales siempre cambiantes, perfeccionando nuestra capacidad para optimizar el tiempo inicial de comercialización y la alta velocidad de desarrollo en cualquier proyecto que asumimos. También hemos interiorizado y estandarizado la creación y el mantenimiento de una adecuada cobertura de pruebas de la base de código y el uso regular de canales CI/CD, haciendo que nuestras vidas y códigos sean mucho más manejables.",
      "Si quieres colaborar en la ampliación de tu equipo de producto, puedes contactar con nosotros a través de nuestra web."
    ],
    "region": ["Europa"],
    "proficiencies": [
      "Vue",
      "Laravel",
      "Node.js",
      "React",
      "React Native"
    ],
    "website": {
      "text": "redberry.international",
      "url": "https://redberry.international/"
    },
    "contact": "nini.doggo@redberry.ge"
  },
  {
    "name": "WebReinvent",
    "logo": "webreinvent.png",
    "intro": "WebReinvent es una empresa de desarrollo de software que ofrece una gama de productos de software de principio a fin, aplicaciones en tiempo real, aplicaciones SaaS multiusuario, API de baja latencia y servicios de desarrollo de aplicaciones móviles. Hemos entregado software de nivel MVP a nivel empresarial en todo el mundo, desde startups a empresas multinacionales. Envíenos un correo electrónico y desarrollemos juntos su producto de software.",
    "description": [
      "WebReinvent es una empresa de desarrollo de software orientado a procesos que proporciona una gama de productos de software de principio a fin, aplicaciones en tiempo real, aplicaciones SaaS multiusuario, API de baja latencia y servicios de desarrollo de aplicaciones móviles. Nuestro equipo está bien versado en VueJs y su ecosistema. Hemos entregado MVP para el software de nivel empresarial desde startups hasta empresas multinacionales. No sólo proyectos de clientes; hemos desarrollado múltiples productos de código abierto que se basan en VueJs. Estamos orgullosos de mencionar que somos uno de los pocos socios oficiales de Laravel y también de NuxtJS.",
      "A nuestro equipo le encanta seguir los estándares de la industria, algunos de los cuales son la gestión de repositorios git, la revisión de código, los despliegues de lanzamiento a través de CI/CD (DevOps), las pruebas de software automatizadas, el mantenimiento de la documentación técnica detallada, la supervisión del rendimiento de la aplicación, etc.",
      "Envíenos un correo electrónico y construyamos su producto de software."
    ],
    "region": ["Norte América", "Asia", "Europa"],
    "proficiencies": ["Vue", "Laravel", "Nuxt", "Ionic", "Node.js"],
    "website": {
      "text": "webreinvent.com",
      "url": "https://webreinvent.com/?utm_source=vuejs.org&utm_medium=website&utm_campaign=partners"
    },
    "contact": "we@webreinvent.com",
    "hiring": "https://webreinvent.com/career?utm_source=vuejs.org&utm_medium=website&utm_campaign=partner-hiring-link"
  },
  {
    "name": "Active Logic",
    "logo": "activelogic.png",
    "flipLogo": true,
    "intro": "No sólo somos una extensión de su equipo de desarrollo Vue.JS, sino que somos un inyector de alta velocidad. Desde 2014, hemos estado proporcionando soluciones de desarrollo de software y de ampliación de personal de primera calidad para varias organizaciones en todo el país. Utilizando nuestro equipo de desarrollo 100% local, podemos llevar a cabo el desarrollo de una nueva aplicación, o continuar con la ingeniería del software existente que necesita modificaciones.",
    "description": [
      "Con sede en el corazón de Estados Unidos, nuestra misión es sencilla: proporcionar a las organizaciones de todo el país soluciones técnicas a medida; un sistema a la vez. Nos enorgullece decir que seguimos cumpliendo nuestra misión a diario.",
      "Creemos que un proyecto, independientemente del tamaño o de la pila tecnológica, siempre debe ser gestionado por un líder de software dedicado que trabaje estrechamente con usted y su equipo. Su experiencia y orientación le permitirán centrarse en sus operaciones comerciales diarias mientras nosotros hacemos el trabajo pesado.",
      "Hemos producido más de 200 proyectos finales para nuestros clientes en los últimos 8 años, todos los cuales siguen reconocidos estándares de la industria para garantizar su funcionalidad, seguridad y escalabilidad.",
      "Optimizar las operaciones de su negocio nunca ha sido tan fácil; ¡póngase en contacto con nosotros aquí en Active Logic hoy mismo!"
    ],
    "proficiencies": [
      "Vue",
      "Laravel",
      "Node.js",
      "React",
      "React Native",
      "Angular",
      "Swift",
      "Kotlin",
      ".NET"
    ],
    "region": ["Norte América"],
    "location": ["Leadwood, Kansas, USA"],
    "website": {
      "text": "activelogic.io",
      "url": "https://activelogic.io/services/vue-js-development/"
    },
    "contact": "sales@activelogic.io",
    "hiring": "https://activelogic.io/careers/",
    "platinum": true
  }
]
