[
  {
    "id": 1346,
    "name": "Stelios Kitziris",
    "slug": "stelios-vue-node-fullstack-developer",
    "alias": "Stelios",
    "description": [
      "Stelios is a fullstack developer with over six years of commercial experience, specializing in the MEVN stack.",
      "He is skilled in building scalable software solutions and has successfully led the development of several large-scale and business-critical systems. Also, he is interested in emerging technologies such as Web3 and AI.",
      "Stelios holds a Master’s Degree in Computing, equipping him with a thorough understanding of the tech landscape. His perfectionist approach is ideal for projects that benefit from meticulous attention to detail."
    ],
    "proficiencies": [
      "MongoDB",
      "Vue.js",
      "Express.js",
      "Node.js",
      "TypeScript",
      "Nuxt.js",
      "Laravel",
      "PHP",
      "PostgreSQL",
      "Ionic",
      "Cordova",
      "MySQL",
      "Docker",
      "React.js"
    ],
    "compensations": {
      "partTime": "€4,276 /month (20 h per week)",
      "monthly": "€7,879 /month (40 h per week)"
    },
    "location": "Greece",
    "region": "GTM+3",
    "experiences": [
      {
        "id": 1,
        "role": "Senior Frontend Engineer",
        "company": "White Hat Gaming",
        "startDate": "Dec 2020",
        "endDate": "May 2024",
        "period": "3 years 5 months",
        "description": [
          {
            "isGrouped": false,
            "content": "White Hat Gaming is a casino game provider company in Malta:"
          },
          {
            "isGrouped": true,
            "content": [
              "Using Vue.js version 3 with composition API for front end development Software Architecture;",
              "Planning and Development for in-house Web Apps; Unit testing."
            ]
          }
        ],
        "skills": [
          "Vue.js",
          "PostgreSQL",
          "Node.js",
          "Nuxt.js",
          "TypeScript"
        ]
      },
      {
        "id": 2,
        "role": "Lead Node.js Developer",
        "company": "Netguru S.A.",
        "startDate": "Dec 2019",
        "endDate": "Dec 2020",
        "period": "1 year",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Provided effective troubleshooting and remediation for web applications;",
              "Interfaced with clients to identify business requirements;",
              "Utilized the latest software development tools, techniques, and approaches. Using Node.js, Express.js, Vue.js, React.js, MongoDB, PostgreSQL. Brought forth a passion and dedication to software development;",
              "Utilized the latest software development tools, techniques, and approaches."
            ]
          }
        ],
        "skills": [
          "Vue.js",
          "MongoDB",
          "Node.js",
          "Express.js",
          "PostgreSQL",
          "TypeScript",
          "Nuxt.js"
        ]
      },
      {
        "id": 3,
        "role": "Lead Software Engineer",
        "company": "Draxis Environment S.A.",
        "startDate": "Oct 2017",
        "endDate": "Dec 2019",
        "period": "2 years 2 months",
        "description": [
          {
            "isGrouped": false,
            "content": "Draxis was a company that created applications for European unions, with a focus on agricultural applications:"
          },
          {
            "isGrouped": true,
            "content": [
              "Performed software architecture, planning, and development for web apps, and mobile apps;",
              "Designed and developed large-scale ICT systems, funded by international donors, the Horizon 2020 program, and the European Commission."
            ]
          }
        ],
        "skills": [
          "PHP",
          "Laravel",
          "JavaScript",
          "React.js",
          "Vue.js",
          "PostgreSQL",
          "TypeScript",
          "Node.js",
          "Nuxt.js",
          "Cordova"
        ]
      },
      {
        "id": 4,
        "role": "Full-Stack Developer",
        "company": "Archirodon Group N.V.",
        "startDate": "Sept 2015",
        "endDate": "Aug 2017",
        "period": "1 year 11 months",
        "description": [
          {
            "isGrouped": false,
            "content": "Archirodon Group N.V. was a construction company focused on building artificial lakes and skyscrapers."
          },
          {
            "isGrouped": true,
            "content": [
              "Developed web applications;",
              "Created, communicated, and managed project plans."
            ]
          }
        ],
        "skills": [
          "Laravel",
          "JavaScript",
          "Angular.js",
          "Vue.js"
        ]
      },
      {
        "id": 5,
        "role": "Web Developer",
        "company": "24 Media Digital Media Group",
        "startDate": "Jan 2015",
        "endDate": "Aug 2015",
        "period": "7 months",
        "description": [
          {
            "isGrouped": false,
            "content": "It was an internship. 24 Media Digital Media Group is a big journal company in Greece."
          },
          {
            "isGrouped": true,
            "content": [
              "Created websites and web applications."
            ]
          }
        ],
        "skills": [
          "PHP",
          "Laravel",
          "Angular.js",
          "WordPress"
        ]
      },
      {
        "id": 6,
        "role": "Web Developer",
        "company": "Shape LTD",
        "startDate": "Dec 2013",
        "endDate": "Feb 2014",
        "period": "2 months",
        "description": [
          {
            "isGrouped": false,
            "content": "It was an ads company, and Stelios was creating websites."
          },
          {
            "isGrouped": true,
            "content": [
              "Developed and supported the website;",
              "Performed SEO of the platform."
            ]
          }
        ],
        "skills": [
          "PHP",
          "WordPress"
        ]
      }
    ],
    "education": [
      {
        "id": 1,
        "degree": "MSc. Computing",
        "school": "Cardiff Metropolitan University",
        "startDate": "2019",
        "endDate": "2022"
      },
      {
        "id": 2,
        "degree": "BSc. Computer Science",
        "school": "IEK Akmi",
        "startDate": "2014",
        "endDate": "2016"
      }
    ]
  },
  {
    "id": 2535,
    "name": "Tomek Jankowski",
    "slug": "tomek-vue-node-fullstack-developer",
    "alias": "Tomek",
    "description": [
      "Tomek is a fullstack developer with over 17 years of commercial experience. Over the years, he has transitioned from using PHP to mastering modern tech stacks, focusing on Vue.js and Node.js in the last six years. His expertise in these technologies has driven the development and support of robust, high-traffic systems.",
      "As the Technical Director at a web development agency for over a decade, he has successfully managed a team of 12 to 17 people and overseen projects for high-profile clients across various sectors.",
      "Tomek has consistently received high appreciation from Proxify clients for his outstanding contributions and leadership."
    ],
    "proficiencies": [
      "Vue.js",
      "Node.js",
      "MongoDB",
      "Nuxt.js",
      "PHP",
      "MySQL",
      "Google Cloud",
      "ElasticSearch",
      "Redis",
      "RabbitMQ",
      "Kubernetes",
      "TypeScript",
      "Express.js",
      "Koa",
      "Nest.js"
    ],
    "compensations": {
      "partTime": "€4,696 /month (20 h per week)",
      "monthly": "€8,551 /month (40 h per week)"
    },
    "location": "Poland",
    "region": "GTM+3",
    "experiences": [
      {
        "id": 1,
        "role": "Technical Director",
        "company": "i3MEDIA LTD",
        "startDate": "Jul 2010",
        "endDate": "Jun 2022",
        "period": "11 years 11 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Feature design, requirements for the dev team.",
              "Development of more advanced or mission-critical features.",
              "Code reviews + support for the other dev/front-end.",
              "Technical meetings with clients.",
              "Infrastructure design and maintenance/automation (GCP last 10 years).",
              "Time & cost estimates."
            ]
          },
          {
            "isGrouped": false,
            "content": "Systems That Built"
          },
          {
            "isGrouped": true,
            "content": [
              "Multi-channel (eBay, Amazon + web front) eCommerce solution with advanced modules to calculate optimal selling prices, complex product definitions & shipping rules, promotions, and integrations with couriers & warehousing solutions.",
              "Public sector CMS with content versioning, advanced access control, publishing flows, widget-based content editor, dynamic forms module with manageable logic, validation, and payments; eventually used by councils for most citizen-council interactions (about 80 forms per website, i.e., bus passes, reporting issues, bins).",
              "Charity donation platform - used to this date by a number of medium to large charities in the UK, integrated with MS Dynamics and other CRM solutions, also integrated with Gov.UK.",
              "Project management - dedicated for media agencies, used internally for about 4 years. Too many features to list, definitely more than Basecamp/TeamWork (leaders at the time).",
              "SEO campaign management - dedicated to marketing agencies, integrated into all relevant tools in the world of online marketing, report generation, prospect negotiations, content writing, time tracking, campaign schedule planning, task lists, etc.",
              "Many bespoke websites: penny auctions, online poster design, search directories of various sorts, award applications, recruitment...the list goes on."
            ]
          }
        ],
        "skills": [
          "PHP",
          "Symfony",
          "Laravel",
          "MySQL",
          "JavaScript",
          "Vue.js",
          "jQuery",
          "Node.js",
          "Zend",
          "Google Cloud"
        ]
      },
      {
        "id": 2,
        "role": "Web Developer, then Lead Developer",
        "company": "i3MEDIA",
        "startDate": "May 2007",
        "endDate": "Jul 2010",
        "period": "3 years 2 months",
        "description": [
          {
            "isGrouped": false,
            "content": "i3MEDIA was a small agency building websites for local businesses.\n\n"
          },
          {
            "isGrouped": true,
            "content": [
              "Developed the first bespoke CMS, which became the core product, the second version of which was implemented on some nationally recognized websites in 2010."
            ]
          }
        ],
        "skills": [
          "PHP",
          "MySQL",
          "JavaScript",
          "Zend"
        ]
      },
      {
        "id": 3,
        "role": "Web Developer",
        "company": "Freelance",
        "startDate": "Mar 2005",
        "endDate": "Mar 2007",
        "period": "2 years",
        "description": [
          {
            "isGrouped": false,
            "content": "Managed to complete 3 commercial projects."
          }
        ],
        "skills": [
          "PHP",
          "MySQL",
          "Adobe Flash"
        ]
      }
    ],
    "education": [
      {
        "id": 1,
        "degree": "MSc. Computer Science",
        "school": "Faculty of Mathematics and Computer Science, University of Łódź",
        "startDate": "2002",
        "endDate": "2006"
      }
    ]
  },
  {
    "id": 3021,
    "name": "Vardan Hayrapetyan",
    "slug": "vardan-vue-node-fullstack-developer",
    "alias": "Vardan",
    "description": [
      "Vardan is a frontend-heavy fullstack developer with expertise in Vue.js, and Node.js. With six years of experience, he has worked on several large-scale web applications, particularly excelling in the real estate sector.",
      "He is known for his leadership skills, guiding development teams toward completing high-quality projects that often exceed expectations. His problem-solving and management abilities ensure successful project outcomes.",
      "Beyond his technical proficiency, Vardan's analytical skills are enhanced by his Master’s in International Relations, adding a unique perspective to his approach in technology projects."
    ],
    "proficiencies": [
      "Vue.js",
      "React.js",
      "Node.js",
      "MongoDB",
      "TypeScript",
      "PostgreSQL",
      "SQL",
      "Apollo",
      "Flask"
    ],
    "compensations": {
      "partTime": "€3,772 /month (20 h per week)",
      "monthly": "€6,871 /month (40 h per week)"
    },
    "location": "Armenia",
    "region": "GTM+4",
    "experiences": [
      {
        "id": 1,
        "role": "Tech Lead",
        "company": "Flair.hr",
        "startDate": "Feb 2023",
        "endDate": "Feb 2024",
        "period": "1 year",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Led the development of the HR Help Desk, Ticketing, Inventory, Documents Management and Performance Reviews projects.",
              "Participated in code reviews and provided constructive feedback to colleagues to ensure best practices and high-quality code.",
              "Led post-project evaluations to identify areas for improvement and implemented process improvements for future projects."
            ]
          }
        ],
        "skills": [
          "React.js",
          "Node.js",
          "GraphQL",
          "Apollo"
        ]
      },
      {
        "id": 2,
        "role": "Tech Lead",
        "company": "Monday Merch",
        "startDate": "Feb 2022",
        "endDate": "Dec 2023",
        "period": "1 year 10 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Effectively communicated project progress, risks, and issues to stakeholders, ensuring that all parties were informed and aligned throughout the project.",
              "Conducted a thorough analysis of existing processes and identified areas for improvement, using this knowledge to develop and implement new processes that better aligned with business needs and objectives.",
              "Switched the MVP version by defining the project structure and revisiting the architecture."
            ]
          }
        ],
        "skills": [
          "JavaScript",
          "Vue.js",
          "TypeScript",
          "Python",
          "Tailwind",
          "Team leading"
        ]
      },
      {
        "id": 3,
        "role": "Web Developer",
        "company": "Remix",
        "startDate": "May 2022",
        "endDate": "Nov 2022",
        "period": "6 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Developed the Remix official website's user interface and core functionalities, ensuring mobile responsiveness;",
              "Utilized GitHub Pages to deploy the React application;",
              "Implemented a custom section scroller for enhanced user experience."
            ]
          }
        ],
        "skills": [
          "JavaScript",
          "React.js",
          "TypeScript",
          "Project management",
          "Tailwind"
        ]
      },
      {
        "id": 4,
        "role": "Tech Lead",
        "company": "Flote",
        "startDate": "May 2017",
        "endDate": "Nov 2022",
        "period": "5 years 6 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Mentored 4 junior frontend developers, enhancing their proficiency in JavaScript and Vue.js;",
              "Collaborated closely with the PM to ensure alignment with project plans, timelines, and billing;",
              "Developed and constructed dynamic user interfaces within Agile environments for enterprise clients with valuations of up to $3 billion;",
              "Participated actively in all development phases, from conceptualization and functional design to detailed implementation, debugging, and software solution deployment;",
              "Supervised and coordinated a team of six employees, overseeing multiple critical business processes;",
              "Led the design of the project's frontend architecture, leading weekly team meetings and formulating and executing strategies and plans;",
              "Provided 24/7 technical support to maintain the seamless operation of the website;",
              "Generated wireframes, mockups, and prototypes to communicate design concepts visually;",
              "Implemented responsive design techniques, ensuring optimal user interface performance across various devices and screen sizes;",
              "Contributed to enhancing the software development by proposing new tools and implementing best practices;",
              "Conducted user research and usability testing, gathering feedback and pinpointing areas for improvement;",
              "Played a key role in documenting project requirements, technical specifications, and development procedures."
            ]
          }
        ],
        "skills": [
          "JavaScript",
          "Vue.js",
          "TypeScript",
          "Project management",
          "Design",
          "Tailwind",
          "Team leading"
        ]
      },
      {
        "id": 5,
        "role": "Tech Lead",
        "company": "Tenanti",
        "startDate": "Dec 2019",
        "endDate": "Jun 2021",
        "period": "1 year 6 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Supervised a web development team, which included contract and off-shore developers, and held supervisory responsibilities over employees;",
              "Established team-wide standards for quality processes and methodologies, ensuring that all applications met the highest quality benchmarks;",
              "Provided mentorship and support to fellow team members, functioning as a team leader and in client interactions;",
              "Led team meetings and organized task prioritization to ensure the punctual delivery of projects met required standards;",
              "Maintained vigilant oversight across all facets of application development to guarantee alignment with quality standards;",
              "Created comprehensive documentation for development tasks and Product Requirement Documents (PRD), ensuring clarity for team members and stakeholders;",
              "Orchestrated software release planning and execution, encompassing testing, deployment, and documentation processes;",
              "Conducted code reviews of team members' work, offering constructive feedback and guidance to enhance code quality."
            ]
          }
        ],
        "skills": [
          "JavaScript",
          "React.js",
          "TypeScript",
          "Flask",
          "Design",
          "Tailwind",
          "Team leading"
        ]
      }
    ],
    "education": [
      {
        "id": 1,
        "degree": "MSc. International Relations and Affairs",
        "school": "Armenian National Academy of Sciences",
        "startDate": "2017",
        "endDate": "2019"
      },
      {
        "id": 2,
        "degree": "BSc. Caucasian Studies",
        "school": "Yerevan State University",
        "startDate": "2013",
        "endDate": "2017"
      }
    ]
  },
  {
    "id": 2030,
    "name": "Emre Demir",
    "slug": "emre-vue-frontend-developer",
    "alias": "Emre",
    "description": [
      "Emre is a talented frontend developer with over six years of commercial experience in IT services & solutions and design. Throughout his career, Emre has worked in various industries, including FinTech, banking, gaming, marketing automation, defense, and cybersecurity.",
      "He is the most skilled in frontend programming languages like JS framework Vue.js, React.js, Typescript, and RxJs. Specializing in collaborating with product managers and designers to gather requirements, produce plans and improve designs for usability and functionality.",
      "Emre is goal-oriented and brings a strong commitment to collaboration. He uses various web design packages to develop custom-crafted, customer-focused websites and designs."
    ],
    "proficiencies": [
      "Vue.js",
      "JavaScript",
      "React.js",
      "Node.js",
      "Nuxt.js",
      "Java",
      "AWS",
      "Figma",
      "Jira",
      "REST API"
    ],
    "compensations": {
      "partTime": "€4,452 /month (20 h per week)",
      "monthly": "€8,215 /month (40 h per week)"
    },
    "location": "Turkey",
    "region": "GTM+3",
    "experiences": [
      {
        "id": 1,
        "role": "Senior Front-end Developer",
        "company": "A5 Labs",
        "startDate": "Mar 2021",
        "endDate": "Oct 2022",
        "period": "1 year 7 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Worked as a Front End Developer in the Back Office project of the WPTO Poker application. This project is responsible for CRUD operations such as reading BOT Detection results, locking accounts, locking withdrawal/deposit, etc...",
              "Responsible for creating GraphQL contracts, and integrating them with the backend (GraphQL, Rest, Websocket).",
              "Created UI library using MaterialUI.",
              "Scheduled meetings with the designer and product manager to handle edge cases, improvements, and requirements."
            ]
          }
        ],
        "skills": [
          "React.js",
          "Vue.js",
          "RxJs",
          "GraphQL",
          "Figma",
          "API",
          "Jira",
          "Material-UI",
          "REST API"
        ]
      },
      {
        "id": 2,
        "role": "Senior Consultant",
        "company": "Softtech",
        "startDate": "Aug 2020",
        "endDate": "Apr 2021",
        "period": "8 months",
        "description": [
          {
            "isGrouped": false,
            "content": "Worked as a Senior Consultant in banking and finance projects as a member of international Agile teams - (Delivery Hub - Remote) Vue.js, Amazon AWS"
          }
        ],
        "skills": [
          "Vue.js",
          "AWS",
          "Agile"
        ]
      },
      {
        "id": 3,
        "role": "Senior Front-end Developer",
        "company": "Insider",
        "startDate": "Feb 2020",
        "endDate": "Aug 2020",
        "period": "6 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Insider—one platform for individualized, cross-channel experiences—enables enterprise marketers to connect customer data across channels and systems, predict their future behavior with an AI intent engine and individualize customer experiences. Marketers use Insider’s platform to deliver experiences across channels like Web, App, Web Push, Email, SMS, and Messaging Apps (WhatsApp, Facebook Messenger, RCS).",
              "Worked as a Lead Senior Frontend Developer, implemented the frontend part of a dashboard using Vue.js."
            ]
          }
        ],
        "skills": [
          "Vue.js"
        ]
      },
      {
        "id": 4,
        "role": "Expert Software Developer",
        "company": "Comodo",
        "startDate": "May 2018",
        "endDate": "Dec 2019",
        "period": "1 year 7 months",
        "description": [
          {
            "isGrouped": false,
            "content": "Worked in DNS-based Web filtering project, Dome Shield, and also worked in sub-projects, Dome Analytics, Comodo Threat Analysis, and NuEDUSec. Worked as a full-stack developer in all of the projects -  Dome Shield, Dome Analytics ,Comodo Threat Analysis and NuEDUSec"
          }
        ],
        "skills": [
          "Vue.js",
          "MySQL",
          "MongoDB",
          "AWS",
          "Redis",
          "Node.js",
          "Jenkins",
          "AWS SQS",
          "AWS Lambda",
          "Nuxt.js",
          "Angular"
        ]
      },
      {
        "id": 5,
        "role": "Software Developer",
        "company": "Freelance",
        "startDate": "Jul 2017",
        "endDate": "May 2018",
        "period": "10 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "He quit his job because he accepted a master's degree at Berlin Technical University. He started freelance work to make some money before he went to Berlin. Some medical issues occurred, and he canceled his master's degree.",
              "Worked in development, design, deployment, and ASO for Android and iOS games using Unity.",
              "Created SPA using Vue.js and Node.js for customers that found me on upwork.com"
            ]
          }
        ],
        "skills": [
          "Vue.js",
          "Node.js",
          "Unity"
        ]
      },
      {
        "id": 6,
        "role": "Research and Development Engineer",
        "company": "Havelsan Teknoloji Radar(HTR)",
        "startDate": "Sep 2016",
        "endDate": "Jul 2017",
        "period": "10 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Designed and implemented Geographic Information System in Java and Android.",
              "Built and managed a database system for both Java and Android versions of GIS using PostgreSql and Java.",
              "Designed RabbitMQ messaging infrastructure for communicating with all system devices.",
              "Integrated Radar, Sonars, Cameras, Cabins, and UPS to GIS using both RabbitMQ and PostgreSQL.",
              "Displayed both live and recorded cameras using video encoder and decoder libraries.",
              "This project is shown by Havelsan Teknoloji Radar A.Ş. at IDEF17 International Defence Industry Fair in İstanbul."
            ]
          }
        ],
        "skills": [
          "PostgreSQL",
          "Java",
          "Android",
          "RabbitMQ"
        ]
      }
    ],
    "education": [
      {
        "id": 1,
        "degree": "BSc. Computer Engineering",
        "school": "TOBB Ekonomi ve Teknoloji Üniversitesi",
        "startDate": "2011",
        "endDate": "2016"
      },
      {
        "id": 2,
        "degree": "BSc. Computer Engineering",
        "school": "School name AGH University of Science and Technology (Exchange)",
        "startDate": "2013",
        "endDate": "2014"
      }
    ]
  },
  {
    "id": 5328,
    "name": "Santiago Anaya",
    "slug": "santiago-anaya-vue-ruby-fullstack-developer",
    "alias": "Santiago",
    "description": [
      "Santiago is a fullstack engineer with over six years of commercial experience, focusing on frontend development. He is an expert in Vue.js. On the backend, he uses Ruby on Rails and various relational databases, particularly PostgreSQL.",
      "He is adept at increasing app performance and enhancing user experience, significantly contributing to every engagement he undertakes. His experience as a Tech and Engineering Lead highlights his leadership capabilities and ability to drive technical initiatives.",
      "Santiago's combination of technical expertise, leadership skills, and dedication to improving application performance makes him a valuable asset to any development team."
    ],
    "proficiencies": [
      "Vue.js",
      "PostgreSQL",
      "Ruby",
      "Ruby on Rails",
      "TypeScript",
      "SQL",
      "Java",
      "Vuex",
      "Backbone",
      "Angular",
      "MySQL",
      "Vuetify",
      "React.js",
      "Node.js",
      "WordPress",
      "MongoDB"
    ],
    "compensations": {
      "partTime": "€3,100 /month (20 h per week)",
      "monthly": "€5,695 /month (40 h per week)"
    },
    "location": "Argentina",
    "region": "GTM-3",
    "experiences": [
      {
        "id": 1,
        "role": "Engineer Manager",
        "company": "WISBOO.COM",
        "startDate": "Oct 2022",
        "endDate": "Aug 2023",
        "period": "10 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "GROUP TECH LEAD & DEVELOPER ENGINEER MANAGER.",
              "APP DEVELOPMENT - WISBOO.COM / A dynamic application tailored for content creators, enabling them to craft and sell courses through personalized websites.",
              "Responsible for the roles of Engineer Manager and Tech Lead.",
              "Helped the team with contributing significantly to a dedicated working cell focused on a specific component of the app."
            ]
          }
        ],
        "skills": [
          "Angular.js",
          "React.js",
          "Ruby on Rails",
          "Bootstrap"
        ]
      },
      {
        "id": 2,
        "role": "Full Stack Developer",
        "company": "KEEPCON",
        "startDate": "Jun 2020",
        "endDate": "Apr 2022",
        "period": "1 year 10 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "APP DEVELOPMENT - KEEPCON.COM / An innovative application for large corporations, aggregating messages from various social media platforms for efficient operator response.",
              "Responsible for a strategic migration to Vue.js.",
              "Helped the team with enhancing the app's performance and user experience."
            ]
          }
        ],
        "skills": [
          "JavaScript",
          "Vue.js",
          "Ruby on Rails",
          "Bootstrap",
          "TypeScript",
          "Java",
          "Backbone"
        ]
      },
      {
        "id": 3,
        "role": "Full Stack Developer",
        "company": "XUBIO",
        "startDate": "Mar 2019",
        "endDate": "Dec 2019",
        "period": "9 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "APP DEVELOPMENT - XUBIO.COM / A specialized application for accountants, designed to manage client or company accounts with features tailored to different countries.",
              "Responsible for providing a robust and user-friendly platform for accounting needs."
            ]
          }
        ],
        "skills": [
          "MySQL",
          "Bootstrap",
          "TypeScript",
          "Java"
        ]
      },
      {
        "id": 4,
        "role": "Full Stack Developer",
        "company": "KEEPERS",
        "startDate": "Feb 2018",
        "endDate": "Mar 2019",
        "period": "1 year 1 month",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "WEB APPLICATIONS DEVELOPMENT.",
              "Responsible for user-friendly and efficient platforms."
            ]
          }
        ],
        "skills": [
          "Vue.js",
          "MongoDB",
          "Node.js"
        ]
      }
    ],
    "education": [
      {
        "id": 1,
        "degree": "BSc. Systems Engeneering",
        "school": "Universidad Technologica Nacinal",
        "startDate": "2015",
        "endDate": "2021"
      }
    ]
  },
  {
    "id": 5697,
    "name": "Harshit Sangani",
    "slug": "harshit-vue-frontend-developer",
    "alias": "Harshit",
    "description": [
      "Harshit is a frontend engineer with over six years of commercial experience, specializing in Vue.js. He has been integral to various stages of the software development lifecycle, from ideation to deployment, ensuring top-notch user experiences and scalable applications.",
      "His expertise extends to modern frontend technologies and proficiency in DevOps practices. Notably, he has led the development of a CO2 Calculator for cost-splitting emissions and a community application targeting a 15M+ user base.",
      "His strong background in building complex, modular frontend solutions and managing deployment cycles and state management tools like Vuex and Apollo further solidifies his capability to deliver high-quality, user-centric applications."
    ],
    "proficiencies": [
      "Vue.js",
      "Nuxt.js",
      "TypeScript",
      "Flutter",
      "Node.js",
      "Golang",
      "GraphQL",
      "React.js",
      "JavaScript",
      "Tailwind",
      "Dart",
      "Apollo",
      "Vuex",
      "Figma",
      "Neo4j",
      "Vuetify",
      "Angular",
      "Storybook",
      "Laravel",
      "React Native"
    ],
    "compensations": {
      "partTime": "€3,688 /month (20 h per week)",
      "monthly": "€6,552 /month (40 h per week)"
    },
    "location": "India",
    "region": "GTM+5:30",
    "experiences": [
      {
        "id": 1,
        "role": "Sr. Software Engineer",
        "company": "Purpose Digital Real Estate GmbH",
        "startDate": "Nov 2022",
        "endDate": "Jun 2024",
        "period": "1 year 7 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Single-handedly worked on a CO2 Calculator, which helped easily calculate the cost split for CO2 emission between landlords and tenants.",
              "Created the base project setup, leveraging TypeScript to speed up the development in the long run.",
              "Generated many modular base components to be used throughout the project.",
              "Helped setting up deployment cycles and environments using Vercel."
            ]
          }
        ],
        "skills": [
          "Vue.js",
          "TypeScript",
          "Microservices",
          "Tailwind",
          "DevOps",
          "Angular",
          "VSCode",
          "Storybook",
          "Vuex"
        ]
      },
      {
        "id": 2,
        "role": "Founder and Engineering Manager",
        "company": "BK Softech",
        "startDate": "Jun 2022",
        "endDate": "Apr 2024",
        "period": "1 year and 10 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Managed a team of 15+ members actively collaborating on non-profit community projects.",
              "Connected communities across divided regions on a single platform to perform integrated businesses, find matrimonial matches, engage in advanced discussions, and much more."
            ]
          }
        ],
        "skills": [
          "React.js",
          "Vue.js",
          "TypeScript",
          "Node.js",
          "Flutter",
          "Golang",
          "Microservices",
          "Figma",
          "Tailwind",
          "Nuxt.js",
          "DevOps",
          "Dart",
          "Neo4j",
          "MVVM",
          "Vuetify",
          "VSCode",
          "Chakra UI",
          "Vuex"
        ]
      },
      {
        "id": 3,
        "role": "Sr. Software Engineer",
        "company": "REO",
        "startDate": "Nov 2021",
        "endDate": "Oct 2022",
        "period": "11 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Worked with a great team to build advanced real-estate brokerage software.",
              "Solved many user-centric issues and helped the team transition to TypeScript.",
              "Created real-time compilation of GraphQL schemas to be directly used in the Frontend codebase, reducing the related bug reports by ~40% and enhancing Developer Experience."
            ]
          }
        ],
        "skills": [
          "Vue.js",
          "TypeScript",
          "GraphQL",
          "Microservices",
          "Tailwind",
          "Nuxt.js",
          "DevOps",
          "VSCode",
          "Apollo",
          "Vuex"
        ]
      },
      {
        "id": 4,
        "role": "Co-Founder and Sr. Software Engineer",
        "company": "HK Byte",
        "startDate": "Nov 2017",
        "endDate": "Apr 2022",
        "period": "4 years 5 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Fulfilled requirements of 20+ clients.",
              "Developed 25+ projects.",
              "Helped the team grow with an overall experience in the SDLC process.",
              "Managed a team of 8+ members.",
              "Provided technical support to two successful startups, uplifting their profits by more than 250% and still counting."
            ]
          }
        ],
        "skills": [
          "Laravel",
          "JavaScript",
          "Vue.js",
          "TypeScript",
          "Adobe Illustrator",
          "Node.js",
          "React Native",
          "Flutter",
          "Figma",
          "Tailwind",
          "Nuxt.js",
          "DevOps",
          "Dart",
          "Neo4j",
          "MVVM",
          "VSCode",
          "Fusion 360",
          "Storybook",
          "Vuex"
        ]
      }
    ],
    "education": [
      {
        "id": 1,
        "degree": "BSc. Computer Science",
        "school": "Smt. CZMG BCA College",
        "startDate": "2015",
        "endDate": "2018"
      }
    ]
  },
  {
    "id": 3709,
    "name": "Kostiantyn Draliuk",
    "slug": "kostiantyn-vue-frontend-developer",
    "alias": "Kostiantyn",
    "description": [
      "Kostiantyn is a frontend developer with eight years of commercial experience. His primary expertise lies in Vue.js, where he has demonstrated exceptional proficiency in building robust and scalable web applications.",
      "On top of his development skills, he has a great eye for design and works alongside the designers in his teams using Figma.",
      "He has a proven track record of working with Proxify clients, delivering outstanding results with both high output and high code quality."
    ],
    "proficiencies": [
      "Vue.js",
      "Vuex",
      "Figma",
      "Nuxt.js",
      "TypeScript",
      "Cypress",
      "Svelte",
      "JavaScript",
      "SvelteKit"
    ],
    "compensations": {
      "partTime": "€4,024 /month (20 h per week)",
      "monthly": "€7,375 /month (40 h per week)"
    },
    "location": "Ukraine",
    "region": "GTM+3",
    "experiences": [
      {
        "id": 1,
        "role": "Software Engineer (Frontend Developer / VueJs Developer / Svelte Developer)",
        "company": "DNV GL (Norway, Remote)",
        "startDate": "Oct 2021",
        "endDate": "Jul 2024",
        "period": "2 years 9 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Developed high-performance micro-frontends using cutting-edge technologies like VueJS, Svelte, and TypeScript, resulting in improved application performance and scalability.",
              "Played a key role in designing and implementing a micro-frontend applications, component libraries, and routing, which allowed for faster development, easier maintenance, and consistent user experiences across multiple applications.",
              "Collaborated with cross-functional teams, including UX/UI designers, backend developers, and product managers, in an Agile environment to ensure smooth communication, timely delivery of features, and overall project success.",
              "Actively participated in code reviews, ensuring adherence to best practices and high-quality code standards.",
              "Implemented and maintained unit and integration tests, resulting in increased application stability and reduced time spent on bug fixes.",
              "Demonstrated commitment to continuous learning and professional development by staying up-to-date with the latest frontend technologies and industry trends, leading to adopting new tools and practices that improved team efficiency and product quality."
            ]
          }
        ],
        "skills": [
          "Vue.js",
          "TypeScript",
          "Svelte"
        ]
      },
      {
        "id": 2,
        "role": "Full-stack Developer",
        "company": "Freelance",
        "startDate": "Dec 2017",
        "endDate": "Oct 2021",
        "period": "3 years 10 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Successfully delivered a wide range of projects for diverse clients, including the development of websites from scratch, enhancements to existing frontends, and the creation of custom web applications, showcasing adaptability and versatility in addressing varied client needs.",
              "Achieved outstanding results in speed optimization, SEO optimization, and quality audits, leading to increased client satisfaction, improved site rankings, and reduced page load times.",
              "Expertly utilized a diverse range of frontend and backend technologies, including VueJS, Laravel, NodeJS, AdonisJs, and ExpressJS, to develop tailor-made solutions that met client requirements and exceeded expectations.",
              "Developed and maintained component libraries and design systems in VueJS, ensuring a seamless user experience, improved maintainability, and efficient UI development across multiple projects.",
              "Collaborated with clients to gather requirements, provide estimates, and offer technical guidance, ensuring clear communication, timely delivery, and alignment with project goals.",
              "Effectively managed projects using tools like Jira, Azure, and YouTrack, prioritizing tasks, tracking progress, and providing regular status updates to clients.",
              "Proactively identified and addressed performance bottlenecks, security vulnerabilities, and code maintainability issues, resulting in the delivery of robust, secure, and maintainable web applications.",
              "Kept up-to-date with the latest industry trends, best practices, and emerging technologies, incorporating them into projects when appropriate to deliver cutting-edge solutions and stay competitive in the market."
            ]
          }
        ],
        "skills": [
          "Laravel",
          "Vue.js",
          "Node.js",
          "Express.js",
          "Azure"
        ]
      },
      {
        "id": 3,
        "role": "Frontend Developer",
        "company": "Boboyan (Khmelnytskyy, Ukraine)",
        "startDate": "Mar 2016",
        "endDate": "Dec 2017",
        "period": "1 year 9 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Developed high-quality frontend solutions for Magento and OpenCart e-commerce platforms, consistently meeting project deadlines and exceeding client expectations with visually appealing and user-friendly designs.",
              "Leveraged expertise in Git, Docker, and Linux to optimize development workflows, enhance collaboration among team members, and ensure efficient deployment and maintenance of applications.",
              "Mentored colleagues in frontend development best practices, fostering a collaborative and supportive team environment that encouraged skill development and knowledge sharing.",
              "Acted as a key contributor in the planning and execution of projects, working closely with project managers and other team members to gather requirements, estimate timelines, and allocate resources effectively.",
              "Implemented responsive design principles, ensuring seamless and consistent user experiences across various devices and browsers, resulting in increased customer engagement and reduced bounce rates.",
              "Proactively identified and resolved performance issues, bugs, and usability concerns, leading to improved site stability, increased conversion rates, and overall enhanced user satisfaction.",
              "Participated in regular code reviews, providing constructive feedback and suggestions for improvement, leading to higher quality code and reduced technical debt.",
              "Stayed up-to-date with the latest industry trends and frontend technologies, incorporating new tools and best practices to improve team efficiency, product quality, and client satisfaction."
            ]
          }
        ],
        "skills": [
          "JavaScript",
          "Angular.js",
          "Docker",
          "Magento",
          "Linux",
          "eCommerce"
        ]
      },
      {
        "id": 4,
        "role": "Frontend Developer",
        "company": "Avivi (Khmelnytskyy, Ukraine)",
        "startDate": "Feb 2015",
        "endDate": "Oct 2016",
        "period": "1 year 8 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Crafted visually stunning and responsive frontend designs for a variety of CMS-based websites using Photoshop and Zeplin mockups, resulting in increased client satisfaction and enhanced user experiences.",
              "Developed responsive email templates that significantly improved client engagement, open rates, and click-through rates by optimizing for various devices and email clients.",
              "Demonstrated proficiency in CSS, HTML, JavaScript, PHP, Angular, and Git to deliver exceptional results, showcasing adaptability and a strong foundation in frontend development technologies.",
              "Collaborated with cross-functional teams, including designers, developers, and project managers, to ensure clear communication, efficient workflows, and alignment with project goals.",
              "Implemented web accessibility best practices, ensuring that websites were usable and inclusive for a diverse range of users, leading to increased site traffic and improved brand reputation.",
              "Actively participated in code reviews and knowledge sharing sessions, contributing to the continuous improvement of the team's coding standards and practices.",
              "Worked with various CMS platforms, gaining valuable experience in customizing and extending their functionality to meet unique client requirements.",
              "Kept up-to-date with the latest industry trends, best practices, and emerging frontend technologies, applying new knowledge and techniques to projects as appropriate."
            ]
          }
        ],
        "skills": [
          "PHP",
          "JavaScript",
          "Angular"
        ]
      }
    ],
    "education": [
      {
        "id": 1,
        "degree": "BSc. Computer Engineering and Systems Programming",
        "school": "Khmelnytskyi National University",
        "startDate": "2013",
        "endDate": "2017"
      }
    ]
  },
  {
    "id": 5022,
    "name": "Eduard Miskov",
    "slug": "eduard-miskov-vue-frontend-developer",
    "alias": "Eduard",
    "description": [
      "Eduard is a frontend developer with over seven years of commercial experience. His primary expertise is crafting visually appealing and user-friendly web applications using Vue.js.",
      "Eduard's positivity and high motivation set him apart in the fast-evolving field of frontend development. His outstanding code quality highlights his technical expertise and commitment to excellence.",
      "He has successfully collaborated with Proxify clients, consistently delivering timely results and maintaining high-quality standards. Eduard's ability to focus on engagement goals and deliver outstanding results makes him a valuable team member."
    ],
    "proficiencies": [
      "Vue.js",
      "Vuex",
      "Nuxt.js",
      "Vanilla JavaScript",
      "TypeScript",
      "Jest",
      "Figma",
      "Vagrant",
      "Shopware",
      "jQuery",
      "Storybook"
    ],
    "compensations": {
      "partTime": "€3,436 /month (20 h per week)",
      "monthly": "€6,119 /month (40 h per week)"
    },
    "location": "Ukraine",
    "region": "GTM+3",
    "experiences": [
      {
        "id": 1,
        "role": "Frontend Developer",
        "company": "Avenga",
        "startDate": "May 2023",
        "endDate": "Aug 2023",
        "period": "3 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Led frontend development efforts in creating the online clothing store network for a leading German market player.",
              "Focused on designing and implementing user panels, product listing pages, and search functionalities to enhance user experience.",
              "Developed reusable components for Storybook, featuring diverse themes, to ensure consistent design elements across all online stores with unique visual identities.",
              "Employed Nuxt 3 for its performance optimization and server-side rendering capabilities, enhancing overall website speed and responsiveness.",
              "Demonstrated proficiency in Storybook, Vue, Nuxt, and Shopware to meet project requirements effectively."
            ]
          }
        ],
        "skills": [
          "JavaScript",
          "Vue.js",
          "TypeScript",
          "Nuxt.js",
          "Storybook",
          "Shopware"
        ]
      },
      {
        "id": 2,
        "role": "Frontend Developer",
        "company": "Simplifai",
        "startDate": "Feb 2021",
        "endDate": "Oct 2022",
        "period": "1 year 8 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Developed a web application for a subsidiary of Elop specializing in smart concrete scanning solutions for architectural and bridge building firms.",
              "Designed and implemented reusable UI components to enhance the application's usability and maintainability.",
              "Utilized TypeScript to write clean and maintainable code, ensuring codebase quality and reliability.",
              "Leveraged the Three.js library to create interactive 3D visualizations of concrete structures, enhancing the user experience.",
              "Demonstrated expertise in Vue.js, JavaScript, Vuetify, and TypeScript to meet the project's technical requirements effectively.",
              "Contributed to the advancement of smart concrete scanning solutions, supporting architectural and bridge-building companies in their projects."
            ]
          }
        ],
        "skills": [
          "JavaScript",
          "Vue.js",
          "TypeScript",
          "Vuetify"
        ]
      },
      {
        "id": 3,
        "role": "Frontend Developer",
        "company": "Recman AS",
        "startDate": "May 2020",
        "endDate": "Feb 2021",
        "period": "9 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Spearheaded the development of a robust web calendar as an integral module within the Recman platform.",
              "Employed Vanilla.js extensively to implement core features, including routing, MVC architecture, state management, and view rendering, all crafted from scratch.",
              "Designed and built a calendar system akin to Google Calendar, seamlessly integrated into the organization's internal infrastructure.",
              "Demonstrated proficiency in Vue.js, JavaScript, and SASS, ensuring the successful completion of the project.",
              "Contributed significantly to enhancing the Recman platform's functionality by adding a feature-rich, internally focused web calendar module."
            ]
          }
        ],
        "skills": [
          "JavaScript",
          "Vue.js"
        ]
      },
      {
        "id": 4,
        "role": "Frontend Developer",
        "company": "Trinetix",
        "startDate": "Jun 2019",
        "endDate": "May 2020",
        "period": "11 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Played a key role in a substantial analytical project aimed at enhancing the hotel and restaurant industry.",
              "Led the migration process of an Angular.js application to Angular, ensuring the seamless transition while preserving the existing design system guidelines.",
              "Successfully implemented new features within the Angular framework to enhance the functionality and capabilities of the application.",
              "Demonstrated proficiency in Vue.js, JavaScript, SASS, and Angular to meet project requirements effectively.",
              "Contributed significantly to the project's success, improving the analytical tools and capabilities available to the hotel and restaurant business."
            ]
          }
        ],
        "skills": [
          "JavaScript",
          "Angular.js",
          "Vue.js",
          "Less CSS",
          "Angular"
        ]
      },
      {
        "id": 5,
        "role": "Medior Frontend Developer",
        "company": "Devellar",
        "startDate": "Mar 2017",
        "endDate": "Jun 2019",
        "period": "2 years 3 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Developed custom WordPress templates from scratch within the educational sector, paying close attention to design aesthetics, SEO best practices, and alignment with the business's core values.",
              "Demonstrated proficiency in JavaScript, WordPress, PHP, and Angular to successfully create bespoke templates tailored to educational needs.",
              "Played a crucial role in enhancing the online presence and functionality of educational websites, catering to both user experience and search engine optimization.",
              "Contributed to the growth and success of educational institutions by providing them with tailored WordPress solutions that aligned with their unique requirements and goals."
            ]
          }
        ],
        "skills": [
          "PHP",
          "MySQL",
          "JavaScript",
          "HTML",
          "WordPress",
          "SQL",
          "Angular",
          "SASS"
        ]
      },
      {
        "id": 6,
        "role": "Medior Frontend Developer",
        "company": "Webkitchen",
        "startDate": "Jun 2016",
        "endDate": "Jan 2017",
        "period": "7 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Crafted customized templates to meet clients' unique design and functionality demands during my tenure at a web agency.",
              "Delivered tailored solutions for various projects, including basic corporate websites and expansive online cosmetics stores, all built from the ground up.",
              "Demonstrated expertise in WordPress, PHP, and MySQL to develop templates that catered to the specific needs and goals of each client.",
              "Played a pivotal role in the agency's ability to provide clients with highly individualized web solutions, contributing to the success of various online ventures."
            ]
          }
        ],
        "skills": [
          "PHP",
          "MySQL",
          "HTML",
          "WordPress",
          "SQL",
          "SASS"
        ]
      },
      {
        "id": 7,
        "role": "Web Development Mentor",
        "company": "Education US",
        "startDate": "Nov 2014",
        "endDate": "Jun 2016",
        "period": "1 year 7 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Offered valuable guidance and mentorship to students, focusing on contemporary website creation techniques, Adobe Creative Cloud (CC) tools, and navigating the job search process.",
              "Equipped students with the necessary skills and knowledge to excel in website development within the dynamic IT industry.",
              "Facilitated students' journeys toward securing their first positions in the IT field by providing essential insights and practical advice.",
              "Acted as a supportive and knowledgeable resource for aspiring professionals, contributing to their career development and growth."
            ]
          }
        ],
        "skills": [
          "jQuery",
          "Adobe Photoshop"
        ]
      },
      {
        "id": 8,
        "role": "Web Designer",
        "company": "Slicemix",
        "startDate": "Mar 2014",
        "endDate": "Aug 2014",
        "period": "5 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Held the position of lead web designer, with primary responsibilities encompassing the creation of visually captivating and impactful promotional websites.",
              "Designed banners and engaging printed materials tailored to clients' distinct requirements within our digital marketing agency.",
              "Leveraged skills in Adobe Photoshop and Adobe Illustrator to ensure the delivery of high-quality design work that effectively communicated our clients' messages and brand identities.",
              "Played a pivotal role in enhancing the online presence and marketing collateral of various clients, contributing to their success in the digital landscape."
            ]
          }
        ],
        "skills": [
          "Adobe Photoshop",
          "Adobe Illustrator"
        ]
      },
      {
        "id": 9,
        "role": "Web Designer",
        "company": "DigitalDealerz",
        "startDate": "Feb 2013",
        "endDate": "Jan 2014",
        "period": "11 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Designed and developed commercial websites and promotional materials catering to the needs of small to mid-sized businesses.",
              "Prioritized user-friendliness, responsiveness, and visual appeal in all web projects to enhance the online presence and customer engagement for clients.",
              "Generated blueprints and wireframes for websites, establishing clear and concise plans before the development phase.",
              "Ensured that the end products were not only interactive but also engaging for users, enhancing the overall user experience and client satisfaction."
            ]
          }
        ],
        "skills": [
          "Adobe Photoshop",
          "Adobe Illustrator",
          "AutoCAD"
        ]
      },
      {
        "id": 10,
        "role": "Junior PHP Developer",
        "company": "Metr&co",
        "startDate": "Jan 2012",
        "endDate": "Jan 2013",
        "period": "1 year",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Actively explored and applied Drupal's API to enhance the functionality and interactivity of web applications, contributing to the mastery of this versatile content management system.",
              "Acquired knowledge and expertise in leveraging Drupal's capabilities to build dynamic and feature-rich web applications.",
              "Kept abreast of the latest trends and best practices in Drupal web development, ensuring the ability to create robust and efficient solutions."
            ]
          }
        ],
        "skills": [
          "PHP",
          "MySQL",
          "SQL",
          "Drupal"
        ]
      }
    ],
    "education": [
      {
        "id": 1,
        "degree": "BSc. Computer Science and Information Technologies",
        "school": "National University of Food Technologies",
        "startDate": "2014",
        "endDate": "2019"
      },
      {
        "id": 2,
        "degree": "Sc. Software Development",
        "school": "Kyiv Optical and Mechanical College",
        "startDate": "2010",
        "endDate": "2014"
      }
    ]
  },
  {
    "id": 4290,
    "name": "Nicolas Tellez",
    "slug": "nicolas-vue-php-fullstack-developer",
    "alias": "Nicolas",
    "description": [
      "Nicolas is a Fullstack and Integrations Developer with seven years of experience working in industries like education, government, transportation, and consulting in both Argentina and the US. He has gained strong technical skills and knows how to adapt to different business needs.",
      "Along with his technical work, Nicolas has been responsible for technical hiring, choosing staff, and helping with internal technical training. His leadership has helped build solid development teams and improve technical knowledge within the companies he's worked for.",
      "Nicolas is skilled in integrating systems with Hubspot and Mercadopago using APIs and webhooks. He has also worked with Mulesoft products to create solutions for both on-premise and cloud-based systems. He is experienced in designing data integration solutions and building Firebase-based projects."
    ],
    "proficiencies": [
      "Vue.js",
      "JavaScript",
      "Nuxt.js",
      "PHP",
      "Laravel",
      "Node.js",
      "MySQL",
      "Firebase",
      "MongoDB",
      "Express.js",
      "Java"
    ],
    "compensations": {
      "partTime": "€4,452 /month (20 h per week)",
      "monthly": "€8,215 /month (40 h per week)"
    },
    "location": "Argentina",
    "region": "GTM-3",
    "experiences": [
      {
        "id": 1,
        "role": "Principal Technical Engineer",
        "company": "MuleSoft",
        "startDate": "Jul 2020",
        "endDate": "May 2024",
        "period": "3 years and 10 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Customer-facing position providing solutions on Mulesoft products and services for integrated solutions for on-premise and cloud.",
              "Member of the Core Runtime team."
            ]
          }
        ],
        "skills": [
          "JavaScript",
          "Docker",
          "Java",
          "Microservices",
          "Maven",
          "Eclipse",
          "Bash",
          "Data Engineering",
          "Linux",
          "API",
          "IntelliJ",
          "Load testing",
          "Apache HTTP Server",
          "AWS EC2"
        ]
      },
      {
        "id": 2,
        "role": "Software Engineer",
        "company": "Fundacion Conocimiento Abierto",
        "startDate": "Jan 2018",
        "endDate": "Jun 2024",
        "period": "6 years 5 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Design and development of communication solutions for the organization.",
              "Involved and responsible for the delivery process as a sysadmin but also self-carry projects as a Full Stack developer."
            ]
          }
        ],
        "skills": [
          "Vue.js",
          "Laravel",
          "Node.js",
          "SQL",
          "Google Cloud",
          "Product Development",
          "Linux",
          "Vuetify",
          "Unix",
          "REST API",
          "Serverless",
          "Vuex"
        ]
      },
      {
        "id": 3,
        "role": "NodeJS Backend Developer",
        "company": "ProMujer",
        "startDate": "Jun 2022",
        "endDate": "Mar 2023",
        "period": "9 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Backend development for Edutech using typescript, NestJs, typeORM.",
              "Worked on the Integration with Hubspot and Mercadopago by API and webhooks."
            ]
          }
        ],
        "skills": [
          "JavaScript",
          "TypeScript",
          "Node.js",
          "Nest.js",
          "REST API",
          "eCommerce"
        ]
      },
      {
        "id": 4,
        "role": "Fullstack Developer",
        "company": "El Patronato en Casa",
        "startDate": "Feb 2020",
        "endDate": "Dec 2020",
        "period": "10 months",
        "description": [
          {
            "isGrouped": false,
            "content": "Development of an educational site, ruins VueJs and Nuxt, based on the Firebase suite (Auth, Firestore, Storage, Hosting, and Functions) and custom integration with Stripe and Vimeo."
          }
        ],
        "skills": [
          "JavaScript",
          "Vue.js",
          "Bootstrap",
          "Node.js",
          "Express.js",
          "Google Cloud",
          "Firebase",
          "Nuxt.js",
          "Vuex"
        ]
      },
      {
        "id": 5,
        "role": "Development/Operations Lead",
        "company": "Raxar",
        "startDate": "Sep 2019",
        "endDate": "Jul 2020",
        "period": "10 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Development and infrastructure lead of the company. Involved and responsible for the delivery process.",
              "Responsible for technical hiring and staff selection. Self-carried critical projects as Full Stack developer. (PHP/Laravel/JS/Vue) Internal technical training."
            ]
          }
        ],
        "skills": [
          "PHP",
          "Laravel",
          "JavaScript",
          "Vue.js",
          "Docker",
          "NGINX",
          "Zend",
          "Operational management",
          "Google Cloud",
          "Firebase",
          "Nuxt.js",
          "Jira",
          "HTML / CSS",
          "Apache HTTP Server",
          "Electron"
        ]
      },
      {
        "id": 6,
        "role": "Product Owner / FullStack Developer",
        "company": "National Ministry of culture",
        "startDate": "Jun 2018",
        "endDate": "Jul 2019",
        "period": "1 year 1 month",
        "description": [
          {
            "isGrouped": false,
            "content": "Led the development of a system to enable artists to submit information and data to run contests for not only visibility/exposure but also potentially earn financial support from the government."
          }
        ],
        "skills": [
          "PHP",
          "Laravel",
          "MySQL",
          "Vue.js",
          "SQL",
          "Nuxt.js",
          "Product Development",
          "REST API",
          "Vuex"
        ]
      },
      {
        "id": 7,
        "role": "Independent Information Technology Consultant",
        "company": "IT Consultant",
        "startDate": "Jun 2016",
        "endDate": "Jul 2019",
        "period": "3 years 1 month",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Custom application and product development as a fullstack developer using PHP/Laravel, VueJS, and mongoDB/MySQL.",
              "Unix sysadmin working with AWS/Azure/GoogleCloud. Provided project management services. Infrastructure support and strategy planning Unix Security assessment and hardening."
            ]
          }
        ],
        "skills": [
          "PHP",
          "Laravel",
          "JavaScript",
          "Vue.js",
          "MongoDB",
          "AWS",
          "Google Cloud",
          "Linux",
          "Vuetify",
          "Azure Cloud",
          "REST API",
          "HTML / CSS",
          "Apache HTTP Server",
          "Electron",
          "Vuex"
        ]
      },
      {
        "id": 8,
        "role": "Senior Web Middleware Specialist",
        "company": "Hewlett Packard",
        "startDate": "Jun 2007",
        "endDate": "Oct 2016",
        "period": "9 years 4 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "L3/L4 support the most widely used web-serving product types and brands. Performed the environment build-outs.",
              "Provided coordination, assessment, and fixes for PCI security compliance rules involving access control, data protection, encryption, and best practices to allow systems to handle credit card transactions.",
              "In charge of the offshore’s web middleware team to act as work queue manager and region SME. Management of thousands of SSL certificates across many platforms."
           ]
          }
        ],
        "skills": [
          "Java",
          "Project management",
          "Google Cloud",
          "Perl",
          "Linux",
          "Unix",
          "Load testing",
          "REST API",
          "Apache HTTP Server",
          "Tomcat",
          "Jakarta",
          "Team leading"
        ]
      }
    ],
    "education": [
      {
        "id": 1,
        "degree": "Sc. Certified MuleSoft Developer",
        "school": "SalesForce",
        "startDate": "2020",
        "endDate": "2020"
      },
      {
        "id": 2,
        "degree": "Sc. Certified Websphere Network Deployment Administration",
        "school": "IBM",
        "startDate": "2004",
        "endDate": "2004"
      }
    ]
  },
  {
    "id": 1020,
    "name": "Abdusaid Umarov",
    "slug": "abdusaid-html-css-vue-typescript-frontend-dev",
    "alias": "Abdusaid",
    "intro": "Abdusaid is a Senior Frontend Developer with over six years of experience, where he’s made a name for himself in Vue.js and Nuxt.js. His skill in Vue.js is top-notch, proven by the perfect 100% score he achieved on the Proxify test.",
    "description": [
      "Though he focuses on frontend work, Abdusaid isn’t just limited to that—he’s also jumped in to help with backend tasks using Laravel.",
      "His experience across identity management, fintech, eCommerce, and other tech sectors shows his ability to adapt and thrive in different environments.",
      "What makes Abdusaid stand out is not just his technical skills but his knack for understanding the bigger picture and delivering work that truly meets the needs of each project he takes on."
    ],
    "proficiencies": [
      "Vue.js",
      "Vuex",
      "Nuxt.js",
      "Laravel",
      "Java",
      "Tailwind",
      "Jest",
      "React.js",
      "Jenkins",
      "Storybook",
      "SonarQube",
      "Docker"
    ],
    "compensations": {
      "partTime": "€2,764 /month (20 h per week)",
      "monthly": "€5,359 /month (40 h per week)"
    },
    "location": "Uzbekistan",
    "region": "GTM+5",
    "experiences": [
      {
        "id": 1,
        "role": "Senior Frontend Developer",
        "company": "Identity Blitz",
        "startDate": "Sept 2023",
        "endDate": "Jul 2024",
        "period": "10 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Got experience creating custom web plugins: i18n localization plugin and automated docker runner plugin using Vite.",
              "Configured project settings with prettierrc and vite.config, postcss.config, tsup.config, ts.config.",
              "Developed Tablet and Mobile views by applying PostCSS."
            ]
          }
        ],
        "skills": [
          "Vue.js",
          "Docker",
          "TypeScript",
          "SCSS"
        ]
      },
      {
        "id": 2,
        "role": "Senior Frontend Developer",
        "company": "Uzum",
        "startDate": "Jan 2023",
        "endDate": "Sept 2023",
        "period": "8 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Got experience in building web apps using Modular Architecture.",
              "Took full responsibility for complex tasks (such as authentication and fixing merge conflicts).",
              "Got experience in using Turbo repo in projects that are based on mono repo architecture.",
              "Did releases into the PROD environment.",
              "Integrated localization using i18n-vue package."
            ]
          }
        ],
        "skills": [
          "Laravel",
          "MySQL",
          "JavaScript",
          "Vue.js",
          "TypeScript",
          "Tailwind"
        ]
      },
      {
        "id": 3,
        "role": "Software Engineer",
        "company": "EPAM Systems",
        "startDate": "Sept 2021",
        "endDate": "May 2023",
        "period": "1 year 8 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Implemented new features using Vue.js/NUXT.js.",
              "Conducted Code reviews.",
              "Bug fixing.",
              "Refactored the code to make it cleaner.",
              "Made documented reports about commits using Gitlab's MergeRequests and Spikes.",
              "Learnt new Prismic CMS.",
              "Got experience with Magnolia CMS to work with the classic version of the project.",
              "Worked in a Scrum environment and understood all of the features and terminologies of the methodology, including sprints, sprint plannings, retrospectives, and daily meetings/Stand-Ups."
            ]
          }
        ],
        "skills": [
          "MySQL",
          "JavaScript",
          "Vue.js",
          "ES5/ES6",
          "Jenkins",
          "Nuxt.js",
          "SonarQube"
        ]
      },
      {
        "id": 4,
        "role": "Frontend Developer",
        "company": "Genesis-Innovation LLC. (Uzcard)",
        "startDate": "Jan 2021",
        "endDate": "Dec 2021",
        "period": "11 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Created components/UI according to Figma design.",
              "Connected APIs to UI using Axios.",
              "Provided token authorizations, silent authentication method, and refreshed token/ JWT token.",
              "Connected charts using Apex charts.",
              "Created Vue Routers.",
              "Used i18n internal language localization.",
              "Widely used 'Vuex' module-based structure.",
              "Created Designs using Element UI."
            ]
          }
        ],
        "skills": [
          "JavaScript",
          "Vue.js",
          "UI",
          "Vuex"
        ]
      },
      {
        "id": 5,
        "role": "Web Developer",
        "company": "Fido-Biznes LLC",
        "startDate": "Jun 2019",
        "endDate": "Jun 2021",
        "period": "2 years",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Worked in a team to build the Uzbekistan Banking System.",
              "Improved System’s performance, stability Querying, indexing, writing procedures, and functions to make the backend section of the system.",
              "Created sophisticated JSP pages with JavaScript language for the frontend logic of the banking system.",
              "Made Java services for exchanging information with the Government Custom Center in XML and JSON formats with key exchange techniques for providing such potential REST APIs."
            ]
          }
        ],
        "skills": [
          "MySQL",
          "JavaScript",
          "Java",
          "SQL",
          "Oracle",
          "JSON",
          "PL/SQL",
          "XML"
        ]
      },
      {
        "id": 6,
        "role": "Web Developer",
        "company": "Artel",
        "startDate": "Sept 2018",
        "endDate": "Jan 2020",
        "period": "1 year 4 months",
        "description": [
          {
            "isGrouped": true,
            "content": [
              "Worked in a team to build a real-world system for the technology industry.",
              "Improved UI/frontend interface.",
              "Built an Analytical section of the System with graphic analysis, according to the industry's provided Excel sheets, using logic to extract data.",
              "Implemented frontend structures/components of the Internal Document Exchange System."
            ]
          }
        ],
        "skills": [
          "JavaScript",
          "Vue.js",
          "ES5/ES6",
          "SCSS",
          "Vuex"
        ]
      }
    ],
    "education": [
      {
        "id": 1,
        "degree": "BSc. Computer Science and Software Engineering",
        "school": "INHA University in Tashkent",
        "startDate": "2015",
        "endDate": "2019"
      }
    ]
  }
]
